# Q1. List any five functions of the pandas library with execution.

In [8]:
# 1) read_csv(): This function is used to read data from a CSV file and create a DataFrame.

import pandas as pd

# Read data from a CSV file
data_frame = pd.read_csv('services.csv').head(3)

# Print the DataFrame
print(data_frame)

   id  location_id  program_id accepted_payments alternate_name  \
0   1            1         NaN               NaN            NaN
1   2            2         NaN               NaN            NaN
2   3            3         NaN               NaN            NaN

                           application_process  \
0                   Walk in or apply by phone.
1           Apply by phone for an appointment.
2  Phone for information (403-4300 Ext. 4322).

                                            audience  \
0  Older adults age 55 or over, ethnic minorities...
1       Residents of San Mateo County age 55 or over
2  Older adults age 55 or over who can benefit fr...

                                         description  \
0  A walk-in center for older adults that provide...
1  Provides training and job placement to eligibl...
2  Offers supportive counseling services to San M...

                                         eligibility email  ...  \
0  Age 55 or over for most programs, age 60 or ov...   NaN  ...
1  Age 55 or over, county resident and willing an...   NaN  ...
2        Resident of San Mateo County age 55 or over   NaN  ...

  interpretation_services                                           keywords  \
0                     NaN  ADULT PROTECTION AND CARE SERVICES, Meal Sites...
1                     NaN  EMPLOYMENT/TRAINING SERVICES, Job Development,...
2                     NaN  Geriatric Counseling, Older Adults, Gay, Lesbi...

  languages                              name required_documents  \
0       NaN   Fair Oaks Adult Activity Center                NaN
1       NaN  Second Career Employment Program                NaN
2       NaN            Senior Peer Counseling                NaN

      service_areas  status wait_time website taxonomy_ids
0             Colma  active  No wait.     NaN          NaN
1  San Mateo County  active   Varies.     NaN          NaN
2  San Mateo County  active   Varies.     NaN          NaN

[3 rows x 22 columns]

In [9]:
# 2) head(): This function returns the first n rows of a DataFrame.

import pandas as pd

# Create a DataFrame
data = {'Name': ['Alice', 'Bob', 'Claire'],
        'Age': [25, 30, 27],
        'Gender': ['Female', 'Male', 'Female']}

df = pd.DataFrame(data)

# Print the first two rows
print(df.head(2))

    Name  Age  Gender
0  Alice   25  Female
1    Bob   30    Male

In [10]:
# 3) groupby(): This function is used to group data based on one or more columns and perform aggregation operations on the groups.

import pandas as pd

# Create a DataFrame
data = {'Name': ['Alice', 'Bob', 'Claire', 'Alice', 'Bob'],
        'Age': [25, 30, 27, 22, 35],
        'Gender': ['Female', 'Male', 'Female', 'Female', 'Male']}

df = pd.DataFrame(data)

# Group by 'Gender' column and calculate the average age
grouped_data = df.groupby('Gender')['Age'].mean()

# Print the average age by gender
print(grouped_data)

Gender
Female    24.666667
Male      32.500000
Name: Age, dtype: float64

In [11]:
# 4) fillna(): This function is used to fill missing values in a DataFrame with a specified value or using various filling methods.

import pandas as pd
import numpy as np

# Create a DataFrame with missing values
data = {'A': [1, 2, np.nan, 4, 5],
        'B': [6, np.nan, 8, np.nan, 10]}

df = pd.DataFrame(data)

# Fill missing values with 0
filled_df = df.fillna(0)

# Print the DataFrame with filled values
print(filled_df)

     A     B
0  1.0   6.0
1  2.0   0.0
2  0.0   8.0
3  4.0   0.0
4  5.0  10.0

In [12]:
# 5) sort_values(): This function is used to sort a DataFrame by one or more columns.

import pandas as pd

# Create a DataFrame
data = {'Name': ['Alice', 'Bob', 'Claire'],
        'Age': [25, 30, 27],
        'Gender': ['Female', 'Male', 'Female']}

df = pd.DataFrame(data)

# Sort the DataFrame by 'Age' column in descending order
sorted_df = df.sort_values('Age', ascending=False)

# Print the sorted DataFrame
print(sorted_df)

     Name  Age  Gender
1     Bob   30    Male
2  Claire   27  Female
0   Alice   25  Female

# Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the DataFrame with a new index that starts from 1 and increments by 2 for each row

In [16]:
import pandas as pd
data = {'A': ['Alice', 'Bob', 'Claire'],
        'B': [25, 30, 27],
        'C': ['Female', 'Male', 'Female']}

df = pd.DataFrame(data)

In [17]:
df

        A   B       C
0   Alice  25  Female
1     Bob  30    Male
2  Claire  27  Female

In [24]:
def reindex_dataframe(df):
    new_index = pd.RangeIndex(start=1, stop=2 * len(df) + 1, step=2)
    df = df.reset_index(drop=True)
    df.index = new_index
    return df

In [25]:
new_df = reindex_dataframe(df)

In [26]:
new_df

        A   B       C
1   Alice  25  Female
3     Bob  30    Male
5  Claire  27  Female

# Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The function should print the sum to the console

In [26]:
data = {'Values': [10,20,30,40,50,60,70]}
def calculate_sum(df):
    sum_values = df['Values'].iloc[:3].sum()
    print("Sum of the first three values:", sum_values)
df = pd.DataFrame(data)
print(df)

   Values
0      10
1      20
2      30
3      40
4      50
5      60
6      70

In [27]:
calculate_sum(df)

Sum of the first three values: 60

# Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column 'Word_Count' that contains the number of words in each row of the 'Text' column

In [27]:
data = {'Text': ['Alice', 'Bob', 'Claire','Sunny', 'rajput']}

df = pd.DataFrame(data)

In [28]:
df

     Text
0   Alice
1     Bob
2  Claire
3   Sunny
4  rajput

In [30]:
add_word_count(df, 'Text')

In [31]:
df

     Text  Word_Count
0   Alice           1
1     Bob           1
2  Claire           1
3   Sunny           1
4  rajput           1

# Q5. How are DataFrame.size() and DataFrame.shape() different?

In [ ]:
The DataFrame.size and DataFrame.shape are both methods in Pandas that provide information about the dimensions of a DataFrame, but they differ in what information they return.

1)DataFrame.size:

The DataFrame.size method returns the total number of elements in the DataFrame. It gives you the count of all cells in the DataFrame, including empty or NaN (missing) values.
The returned value is an integer representing the total number of elements.

2)DataFrame.shape:

The DataFrame.shape attribute returns a tuple that represents the dimensions of the DataFrame. It provides information about the number of rows and columns in the DataFrame.
The returned value is a tuple in the format (rows, columns), where rows represents the number of rows in the DataFrame, and columns represents the numbers of columns.

# Q6. Which function of pandas do we use to read an excel file?

In [ ]:
import pandas as pd

# Read the Excel file
df = pd.read_excel('file.xlsx')

# Display the DataFrame
print(df)

# Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email addresses in the format 'username@domain.com'. Write a Python function that creates a new column 'Username' in df that contains only the username part of each email address.

In [36]:
data = {'name': ['Sunny', 'Bob', 'dhiman'],
        'age': [25, 30, 27],
        'sex': ['Male', 'Male', 'Male'],
        'Email' : ['Rajput@domain.com','Kumar@domain.com','Sharma@gmail.com']
       }
df = pd.DataFrame(data)
print(df)

     name  age   sex              Email
0   Sunny   25  Male  Rajput@domain.com
1     Bob   30  Male   Kumar@domain.com
2  dhiman   27  Male   Sharma@gmail.com

In [39]:
 def extract_username(df, column_name):
    df['Username'] = df[column_name].str.split('@').str[0]

In [40]:
extract_username(df, 'Email')

In [41]:
df

     name  age   sex              Email Username
0   Sunny   25  Male  Rajput@domain.com   Rajput
1     Bob   30  Male   Kumar@domain.com    Kumar
2  dhiman   27  Male   Sharma@gmail.com   Sharma

# Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The function should return a new DataFrame that contains only the selected rows.

In [45]:
data = {'A': [2,4,5,6,8,9,3],
        'B': [1,3,4,9,7,2,5],
        'c': [7,3,2,4,0,6,8]}
df = pd.DataFrame(data)
print(df)

   A  B  c
0  2  1  7
1  4  3  3
2  5  4  2
3  6  9  4
4  8  7  0
5  9  2  6
6  3  5  8

In [51]:
type(df)

pandas.core.frame.DataFrame

In [59]:
def select_rows(df):
    selected_df = df[(df['A'] > 5) & (df['B'] < 10)]
    return selected_df

In [60]:
df

   A  B  c
0  2  1  7
1  4  3  3
2  5  4  2
3  6  9  4
4  8  7  0
5  9  2  6
6  3  5  8

In [61]:
new_df = select_rows(df)

In [62]:
df

   A  B  c
0  2  1  7
1  4  3  3
2  5  4  2
3  6  9  4
4  8  7  0
5  9  2  6
6  3  5  8

# Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean, median, and standard deviation of the values in the 'Values' column.

In [2]:
import pandas as pd
data = {'Values': [2,4,5,6,8,9,3]}
df = pd.DataFrame(data)
print(df)

   Values
0       2
1       4
2       5
3       6
4       8
5       9
6       3

In [3]:
def calculate_statistics(df, column_name):
    values = df[column_name]
    mean = values.mean()
    median = values.median()
    std = values.std()
    return mean, median, std

In [10]:
mean, median, std = calculate_statistics(df, 'Values')

In [11]:
mean

5.285714285714286

In [12]:
median

5.0

In [13]:
std

2.5634797778466227

# Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days for each row in the DataFrame. The moving average should be calculated using a window of size 7 and should include the current day.

In [15]:
import pandas as pd
data = {'Sales': [270,450,500,609,345],
        'Date' : ['11-01-2023','11-02-2023','11-03-2023','11-04-2023','11-05-2023']
       }
df = pd.DataFrame(data)
print(df)

   Sales        Date
0    270  11-01-2023
1    450  11-02-2023
2    500  11-03-2023
3    609  11-04-2023
4    345  11-05-2023

In [16]:
def calculate_moving_average(df):
    df['MovingAverage'] = df['Sales'].rolling(window=7, min_periods=1).mean()

In [17]:
calculate_moving_average(df)

In [18]:
df

   Sales        Date  MovingAverage
0    270  11-01-2023     270.000000
1    450  11-02-2023     360.000000
2    500  11-03-2023     406.666667
3    609  11-04-2023     457.250000
4    345  11-05-2023     434.800000

# Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g. Monday, Tuesday) corresponding to each date in the 'Date' column

In [8]:
import pandas as pd
data = {
        'Date' : ['11-01-2023','11-02-2023','11-03-2023','11-04-2023','11-05-2023']
       }
df = pd.DataFrame(data)
print(df)

         Date
0  11-01-2023
1  11-02-2023
2  11-03-2023
3  11-04-2023
4  11-05-2023

In [9]:
df["weekdays"] = ["Sunday","Monday","tuesday","Wednesday","Friday"]

In [10]:
df

         Date   weekdays
0  11-01-2023     Sunday
1  11-02-2023     Monday
2  11-03-2023    tuesday
3  11-04-2023  Wednesday
4  11-05-2023     Friday

# Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

In [18]:
import pandas as pd
data = {
        'Date' : ['01-01-2023','11-01-2023','17-01-2023','25-01-2023','31-01-2023']
       }
df = pd.DataFrame(data)
print(df)

         Date
0  01-01-2023
1  11-01-2023
2  17-01-2023
3  25-01-2023
4  31-01-2023

In [19]:
df

         Date
0  01-01-2023
1  11-01-2023
2  17-01-2023
3  25-01-2023
4  31-01-2023

In [20]:
import pandas as pd

def select_rows_between_dates(df):
    # Convert 'Date' column to datetime
    df['Date'] = pd.to_datetime(df['Date'])
    
    # Select rows where date is between '2023-01-01' and '2023-01-31'
    selected_rows = df[(df['Date'] >= '2023-01-01') & (df['Date'] <= '2023-01-31')]
    
    return selected_rows

In [26]:
select_rows_between_dates

# Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to be imported?

In [ ]:
to use the basic functions of pandas, the first and foremost library that needs to be imported is pandas itself.
The pandas library provides the primary data structures and functions for data manipulation and analysis.

In [46]:
# THE END